tutorials/Fracture/withCapillaryPressure/Mis0.05Pc01000Trial1Case/0/epss
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epss;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
196256
(
0.44393
0.443663
0.389613
0.444017
0.356049
0.479604
0.400454
0.459545
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
    upperInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    lowerInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    rightInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    leftInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
